{"id": "CI-001", "category": "CI", "severity": "S1", "effort": "E1", "file": ".github/workflows/deploy-firebase.yml", "line": 31, "title": "Firebase CLI installed globally without version pinning", "description": "The Firebase CLI is installed via 'npm install -g firebase-tools' without specifying a version. This creates supply chain risk and reproducibility issues. The CLI may update to incompatible versions, breaking deployments.", "recommendation": "Pin to a specific Firebase CLI version: 'npm install -g firebase-tools@13.1.0' (replace with desired stable version). Add 'npm ls firebase-tools' in a later step to verify pinned version."}
{"id": "CI-002", "category": "CI", "severity": "S1", "effort": "E1", "file": ".github/workflows/deploy-firebase.yml", "line": 70, "title": "Critical function deletion with continue-on-error masks failures", "description": "The 'Delete Old/Deprecated Functions' step uses 'continue-on-error: true' while deleting critical functions (adminHealthCheck, exportUserData, deleteUserAccount, etc.). If deletion fails silently, old code may remain in production, creating security gaps or data loss vectors.", "recommendation": "Remove 'continue-on-error: true' and instead create wrapper logic: only suppress errors for functions confirmed as non-existent, not all failures. Alternatively, move this to a separate manual workflow with explicit function list review before execution."}
{"id": "CI-003", "category": "CI", "severity": "S2", "effort": "E1", "file": ".github/workflows/ci.yml", "line": 39, "title": "Unused dependency check is non-blocking but should be tracked", "description": "The 'Check for unused dependencies/exports' step runs with 'continue-on-error: true' and has a known issue (leaflet.markercluster flagged as unused). While non-blocking is reasonable, the known false positive is not tracked in a separate issue or backlog item, making it invisible to triaging.", "recommendation": "Create a separate backlog entry in docs/technical-debt/MASTER_DEBT.jsonl for this known false positive. Update the comment to reference the backlog ID. Consider refining the dependency checker to exclude CSS imports or maintain a whitelist."}
{"id": "CI-004", "category": "CI", "severity": "S1", "effort": "E2", "file": ".github/workflows/ci.yml", "line": 46, "title": "Action SHA pinned correctly but commit message vulnerable to supply chain attacks", "description": "While 'tj-actions/changed-files' is pinned to SHA v46.0.2, the commit message in the inline comment references CVE-2025-30066 but does not validate the SHA signature. If GitHub is compromised, actions can be replaced. Additionally, the pattern check on line 65 uses variable interpolation without bounds checking.", "recommendation": "Add signature verification step before using changed-files: 'if [ $(git rev-parse --short refs/tags/v46.0.2) != 26a38635 ]; then exit 1; fi'. Alternatively, use GitHub's official 'dorny/paths-filter' which is similarly maintained and signature-verified by GitHub."}
{"id": "CI-005", "category": "CI", "severity": "S2", "effort": "E1", "file": ".github/workflows/ci.yml", "line": 75, "title": "Pattern compliance check non-blocking on main push masks failures", "description": "The 'Pattern compliance check (push to main)' step runs with 'continue-on-error: true' without blocking main branch merges. This allows anti-patterns (e.g., direct Firestore writes, unverified function calls) to reach production, violating security rules documented in CLAUDE.md Section 2.", "recommendation": "Change 'continue-on-error: true' to 'continue-on-error: false' to enforce pattern compliance. If visibility is needed without blocking, use 'GitHub branch protection rules' to block on this check instead of silencing it in the workflow."}
{"id": "CI-006", "category": "CI", "severity": "S2", "effort": "E1", "file": ".github/workflows/sonarcloud.yml", "line": 29, "title": "SonarCloud checkout SHA pinned but version tag mismatch undetected", "description": "The checkout action uses pinned SHA '34e114876b0b11c390a56381ad16ebd13914f8d5' for v4.3.1, but v4.3.1 was released before this SHA exists in the repository (version mismatch). This creates confusion during audits and may hide the actual version being used.", "recommendation": "Use 'uses: actions/checkout@v4' with semantic versioning only, or verify the SHA matches the tag: 'git rev-parse v4.3.1' in the actions/checkout repository to confirm. Add a comment documenting the rationale if SHA pinning is mandatory."}
{"id": "CI-007", "category": "CI", "severity": "S2", "effort": "E0", "file": ".github/workflows/backlog-enforcement.yml", "line": 27, "title": "npm ci uses offline cache with weak flags for supply chain security", "description": "The 'npm ci --prefer-offline --no-audit --no-fund' command disables audit checks (--no-audit), which bypasses vulnerability scanning during CI. This allows known vulnerable dependencies to be installed without detection.", "recommendation": "Remove '--no-audit' flag: 'npm ci --prefer-offline'. The '--no-audit' flag should only be used in local development if needed. CI must always run audits to catch vulnerabilities before deployment."}
{"id": "CI-008", "category": "CI", "severity": "S2", "effort": "E1", "file": ".github/workflows/backlog-enforcement.yml", "line": 80, "title": "Comment action uses hardcoded GitHub script without version pinning", "description": "Line 80 uses 'uses: actions/github-script@60a0d83039c74a4aee543508d2ffcb1c3799cdea # v7.0.1' (SHA pinned correctly), but the comment creation on line 96 does not validate the PR context exists (no null check). If the workflow is triggered in a non-PR context (scheduled cron), github.rest.issues.createComment will fail silently due to missing issue_number.", "recommendation": "Add early validation: 'if (github.event_name !== 'pull_request') { return; }' before the comment creation block. Alternatively, guard the entire 'Comment on PR' step with 'if: github.event_name == 'pull_request'' to skip for scheduled runs."}
{"id": "CI-009", "category": "CI", "severity": "S1", "effort": "E1", "file": ".github/workflows/deploy-firebase.yml", "line": 58, "title": "Service account JSON written to $HOME without umask verification", "description": "The Firebase service account credentials are written to '$HOME/gcloud-key.json' with 'chmod 600' (line 59), but there's no verification that the file was created securely before chmod. A race condition could allow other processes to read credentials before permissions are applied. Additionally, the file is not deleted if the build is cancelled (only in the 'always()' cleanup block).", "recommendation": "Use 'mktemp --mode 600' to create the file atomically with secure permissions: 'mktemp=$(mktemp -t firebase-key.XXXXXX); mktemp=$(mktemp --mode 600)' or use GitHub secrets directly in gcloud commands without intermediate files if possible. Ensure cleanup runs even on cancellation by using 'trap' in the run block."}
{"id": "CI-010", "category": "CI", "severity": "S0", "effort": "E2", "file": ".github/workflows/deploy-firebase.yml", "line": 65, "title": "Hardcoded project ID 'sonash-app' bypasses environment validation", "description": "The Firebase project is hardcoded as 'sonash-app' in multiple deploy commands (lines 65, 77, 80, 83), but there's no validation that GOOGLE_APPLICATION_CREDENTIALS credentials match the target project. An attacker with a valid GCP service account for a different project could deploy to the wrong environment. Additionally, the project ID should be injected from secrets/environment to support staging/production switching.", "recommendation": "Store project ID in GitHub secrets (FIREBASE_PROJECT_ID) and reference it as '${{ secrets.FIREBASE_PROJECT_ID }}'. Add a validation step: 'gcloud config get-value project' and compare against expected project. This prevents deploying to wrong environments."}
