{"id":"ENH-0001","source_id":"PR-360-design-001","source_file":"scripts/improvements/intake-audit.js","category":"devx-automation","title":"Replace raw operator username with privacy-safe identifier in audit logs","description":"The intake audit log stores the operator derived from os.userInfo().username or environment variables, which may be considered PII depending on policy and log retention/visibility. Consider replacing with a SHA-256 hash prefix or anonymized operator ID for privacy compliance while maintaining audit traceability.","impact":"I3","effort":"E1","confidence":75,"status":"PROPOSED","fingerprint":"devx-automation::scripts/improvements/intake-audit.js::operator-pii-audit-logs","file":"scripts/improvements/intake-audit.js","line":779,"created":"2026-02-11","current_approach":"Raw os.userInfo().username or $USER/$USERNAME stored in intake audit log entries","proposed_outcome":"SHA-256 hash prefix of username (e.g., first 8 chars) provides audit traceability without exposing PII","counter_argument":"This is an internal CLI script run by developers — the operator field provides accountability and the logs are local, not shared externally. Hashing adds complexity for minimal privacy benefit in a single-user context.","why_it_matters":"If audit logs are ever committed, shared, or retained in CI, raw usernames become PII that may violate data handling policies. A hash-based approach maintains auditability without exposure risk."}
{"id":"ENH-0002","source_id":"PR-360-design-002","source_file":"scripts/improvements/dedup-multi-pass.js","category":"devx-automation","title":"Add operator identity and outcome to dedup pipeline audit log","description":"The dedup pipeline performs significant write operations to IMS canonical files (deduped.jsonl, review-needed.jsonl) without recording operator identity or execution outcome in the dedup-log.jsonl, making full reconstruction potentially incomplete for compliance purposes.","impact":"I3","effort":"E1","confidence":70,"status":"PROPOSED","fingerprint":"devx-automation::scripts/improvements/dedup-multi-pass.js::dedup-audit-context","file":"scripts/improvements/dedup-multi-pass.js","line":640,"created":"2026-02-11","current_approach":"dedup-log.jsonl records merge decisions but not who ran the pipeline or the final outcome summary","proposed_outcome":"Add operator context and execution summary (items in/out, passes run, errors) as first/last entries in dedup-log.jsonl","counter_argument":"The dedup pipeline is deterministic given the same input — operator identity adds no analytical value. Git commit history already tracks who ran what and when.","why_it_matters":"For audit trail completeness, knowing who triggered the pipeline and the high-level outcome makes log reconstruction easier without needing to correlate with git history."}
{"id":"ENH-0003","source_id":"PR-360-compliance-001","source_file":"scripts/improvements/generate-views.js","category":"devx-automation","title":"Harden escapeMarkdown() against Markdown/HTML injection in generated views","description":"The escapeMarkdown() function in generate-views.js only escapes pipe characters and newlines, leaving untrusted JSONL fields (title, category, dependencies, file) vulnerable to Markdown/HTML injection. If rendered documentation is ever served in a web context, crafted values could inject phishing links or misleading content.","impact":"I2","effort":"E2","confidence":65,"status":"PROPOSED","fingerprint":"devx-automation::scripts/improvements/generate-views.js::markdown-injection-escaping","file":"scripts/improvements/generate-views.js","line":38,"created":"2026-02-11","current_approach":"escapeMarkdown() only escapes | and \\n — HTML tags, links, and other Markdown syntax pass through unescaped","proposed_outcome":"Extend escapeMarkdown() to neutralize HTML tags (<>), square bracket links, backtick injection, and other Markdown syntax in untrusted fields","counter_argument":"Generated views are committed as .md files viewed in GitHub or local editors — they are not served as raw HTML. GitHub's Markdown renderer already sanitizes HTML. The risk is theoretical for the current deployment model.","why_it_matters":"Defense in depth: if views are ever rendered outside GitHub (e.g., a docs site, wiki, or internal tool), the lack of escaping becomes an XSS vector. Fixing it now prevents a class of vulnerabilities."}
